Ran Plan for 3 projects:

1. dir: `bruno-athaide-product-test/poc-config-v3` workspace: `default`
1. dir: `bruno-athaide-product-test/poc-config-v3/prod` workspace: `default`
1. dir: `bruno-athaide-product-test/poc-config-v3/segments` workspace: `default`
---

### 1. dir: `bruno-athaide-product-test/poc-config-v3` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.configcat_products.my_products: Reading...
data.configcat_products.my_products: Read complete after 1s [id=1756137695]
data.configcat_environments.prod_environment: Reading...
data.configcat_environments.prod_environment: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756137695]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_config.my_config will be created
+ resource "configcat_config" "my_config" {
      + description        = "My config v3 description - testing"
      + evaluation_version = "v2"
      + id                 = (known after apply)
      + name               = "My config v3"
      + order              = 0
      + product_id         = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ config_id  = (known after apply)
+ product_id = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/poc-config-v3
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fpoc-config-v3%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/poc-config-v3
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `bruno-athaide-product-test/poc-config-v3/prod` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.parent_config.data.configcat_products.my_products: Reading...
module.segments.module.parent_config.data.configcat_products.my_products: Reading...
module.parent_config.data.configcat_products.my_products: Read complete after 0s [id=1756137699]
module.parent_config.data.configcat_environments.prod_environment: Reading...
data.configcat_environments.prod_environment: Reading...
module.segments.module.parent_config.data.configcat_products.my_products: Read complete after 0s [id=1756137699]
module.segments.module.parent_config.data.configcat_environments.prod_environment: Reading...
module.segments.data.configcat_environments.prod_environment: Reading...
data.configcat_environments.prod_environment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756137699]
module.parent_config.data.configcat_environments.prod_environment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756137699]
module.segments.module.parent_config.data.configcat_environments.prod_environment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756137699]
module.segments.data.configcat_environments.prod_environment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756137699]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_setting.my_second_ff will be created
+ resource "configcat_setting" "my_second_ff" {
      + config_id    = (known after apply)
      + hint         = (known after apply)
      + id           = (known after apply)
      + key          = "MySecondFF"
      + name         = "My Second Feature Flag"
      + order        = 1
      + setting_type = "boolean"
    }

  # configcat_setting.my_string_setting_v2 will be created
+ resource "configcat_setting" "my_string_setting_v2" {
      + config_id    = (known after apply)
      + hint         = (known after apply)
      + id           = (known after apply)
      + key          = "StringSettingKey"
      + name         = "String setting"
      + order        = 0
      + setting_type = "string"
    }

  # configcat_setting_value_v2.my_second_ff_value will be created
+ resource "configcat_setting_value_v2" "my_second_ff_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = {
          + bool_value = false
        }
    }

  # configcat_setting_value_v2.string_setting_value will be created
+ resource "configcat_setting_value_v2" "string_setting_value" {
      + environment_id  = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id              = (known after apply)
      + init_only       = true
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + targeting_rules = [
          + {
              + conditions = [
                  + {
                      + user_condition = {
                          + comparator           = "sensitiveTextEquals"
                          + comparison_attribute = "email"
                          + comparison_value     = {
                              + string_value = "@configcat.com"
                            }
                        }
                    },
                ]
              + value      = {
                  + string_value = "custom"
                }
            },
          + {
              + conditions = [
                  + {
                      + segment_condition = {
                          + comparator = "isIn"
                          + segment_id = (known after apply)
                        }
                    },
                ]
              + value      = {
                  + string_value = "beta-feature"
                }
            },
        ]
      + value           = {
          + string_value = "test"
        }
    }

  # module.parent_config.configcat_config.my_config will be created
+ resource "configcat_config" "my_config" {
      + description        = "My config v3 description - testing"
      + evaluation_version = "v2"
      + id                 = (known after apply)
      + name               = "My config v3"
      + order              = 0
      + product_id         = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

  # module.segments.configcat_segment.my_segment will be created
+ resource "configcat_segment" "my_segment" {
      + comparator           = "sensitiveIsOneOf"
      + comparison_attribute = "email"
      + comparison_value     = "betauser1@example.com,betauser2@example.com"
      + description          = "Beta users' description"
      + id                   = (known after apply)
      + name                 = "Beta users"
      + product_id           = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

  # module.segments.module.parent_config.configcat_config.my_config will be created
+ resource "configcat_config" "my_config" {
      + description        = "My config v3 description - testing"
      + evaluation_version = "v2"
      + id                 = (known after apply)
      + name               = "My config v3"
      + order              = 0
      + product_id         = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/poc-config-v3/prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fpoc-config-v3%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/poc-config-v3/prod
  ```
Plan: 7 to add, 0 to change, 0 to destroy.

---
### 3. dir: `bruno-athaide-product-test/poc-config-v3/segments` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.parent_config.data.configcat_products.my_products: Reading...
module.parent_config.data.configcat_products.my_products: Read complete after 0s [id=1756137703]
module.parent_config.data.configcat_environments.prod_environment: Reading...
data.configcat_environments.prod_environment: Reading...
data.configcat_environments.prod_environment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756137703]
module.parent_config.data.configcat_environments.prod_environment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756137703]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_segment.my_segment will be created
+ resource "configcat_segment" "my_segment" {
      + comparator           = "sensitiveIsOneOf"
      + comparison_attribute = "email"
      + comparison_value     = "betauser1@example.com,betauser2@example.com"
      + description          = "Beta users' description"
      + id                   = (known after apply)
      + name                 = "Beta users"
      + product_id           = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

  # module.parent_config.configcat_config.my_config will be created
+ resource "configcat_config" "my_config" {
      + description        = "My config v3 description - testing"
      + evaluation_version = "v2"
      + id                 = (known after apply)
      + name               = "My config v3"
      + order              = 0
      + product_id         = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ beta_users_segment_id = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/poc-config-v3/segments
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fpoc-config-v3%252Fsegments%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/poc-config-v3/segments
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### Plan Summary

3 projects, 3 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```